{"task_description": "\nIn this task, you will need to talk with our restaurants searching bot and tell us in which turns you think our bot's answer are inappropriate. <br><br>\n\nExample:<br><br>\n------------------- Task Begin ------------------- <br><br>\n<b>Restaurant bot: In this task, you will need to talk with our restaurants searching bot. You want to find a cheap restaurant. </b><br><br>\n\n<b>Restaurant bot</b>:[Turn 1] Hello, welcome to the restaurant finding system. How may I help you?<br><br>\n<b>Worker</b>: Hi, I want to find a restaurant<br><br>\n\n<b>Restaurant bot</b>:[Turn 2] What part of town do you have in mind?<br><br>\n<b>Worker</b>: I'm looking for a restaurant in the city centre<br><br>\n\n<b>Restaurant bot</b>:[Turn 3] What kind of food would you like?<br><br>\n<b>Worker</b>: I prefer Chinese food<br><br>\n\n<b>Restaurant bot</b>:[Turn 4] Would you like something in the cheap, moderate, or expensive price range?<br><br>\n<b>Worker</b>: as cheap as possible<br><br>\n\n<b>Restaurant bot</b>:[Turn 5] golden house is a nice place, it is in the cheap price range , it is in the centre of town and it serves chinese food.<br><br>\n<b>Worker</b>: okay, thank you. bye<br><br>\n\n<b>Restaurant bot</b>:[Turn 6]Thank you, goodbye.<br><br>\n\n<b>Restaurant bot</b>: Please tell me if you could find a restaurant that meets your constraints using our system and get all information (phone number/address) you need.(yes/no)<br><br>\n<b>Worker</b>: yes<br><br>\n\n<b>Restaurant bot</b>: Please tell me the turns you believe system's actions are contextually wrong, using turn numbers connected by ',' (e.g. 1,3,6). If you are completely satisfied by this conversation, please write 0.<br><br>\n<b>Worker</b>: 0<br><br>\n\nIf you want to quit the conversation please type in \"quit\". However, you still need to finish the follow-up questionnaire. When you finish the questionnaire, a blue button called \"Done with this HIT\" will show up. Please click it to finish the hit. <br><br>\n\n------------------- Task Done ------------------- <br><br>\nIf you are ready, please click \"Accept HIT\" to start this task.\n", "is_sandbox": true, "mturk_submit_url": "https://workersandbox.mturk.com/mturk/externalSubmit", "unique_worker": false, "frame_height": 650}